grpc-vs-rest-microservice-fan-out-benchmark/rest.txt
Run #1
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     7,379 |    29,521
> min response time (ms)                                                             |         4 |         4 |    15,000
> max response time (ms)                                                             |    60,002 |    15,625 |    60,002
> mean response time (ms)                                                            |    15,327 |     3,395 |    18,310
> response time std deviation (ms)                                                   |    12,193 |     3,745 |    11,740
> response time 50th percentile (ms)                                                 |    15,001 |     2,035 |    15,001
> response time 75th percentile (ms)                                                 |    15,002 |     6,060 |    15,002
> response time 95th percentile (ms)                                                 |    50,386 |    11,760 |    58,972
> response time 99th percentile (ms)                                                 |    60,001 |    12,486 |    60,001
> mean throughput (rps)                                                              |    150.61 |     30.12 |    120.49
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          3,042  (8.24%)
> OK: 800 ms <= t < 1200 ms                                                                                 153  (0.41%)
> OK: t >= 1200 ms                                                                                        4,184 (11.34%)
> KO                                                                                                     29,521    (80%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     27,352 (92.65%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,169  (7.35%)
========================================================================================================================

Run #2
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     2,921 |    33,979
> min response time (ms)                                                             |         6 |         6 |    15,000
> max response time (ms)                                                             |    60,060 |    18,878 |    60,060
> mean response time (ms)                                                            |    16,815 |     3,530 |    17,957
> response time std deviation (ms)                                                   |    11,436 |     4,094 |    11,140
> response time 50th percentile (ms)                                                 |    15,002 |     2,100 |    15,002
> response time 75th percentile (ms)                                                 |    15,006 |     5,566 |    15,006
> response time 95th percentile (ms)                                                 |    45,415 |    12,389 |    55,732
> response time 99th percentile (ms)                                                 |    60,018 |    16,611 |    60,001
> mean throughput (rps)                                                              |    150.61 |     11.92 |    138.69
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          1,214  (3.29%)
> OK: 800 ms <= t < 1200 ms                                                                                  70  (0.19%)
> OK: t >= 1200 ms                                                                                        1,637  (4.44%)
> KO                                                                                                     33,979 (92.08%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     31,750 (93.44%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,229  (6.56%)
========================================================================================================================

Run #3
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |       914 |    35,986
> min response time (ms)                                                             |       212 |       212 |    15,000
> max response time (ms)                                                             |    60,022 |    21,388 |    60,022
> mean response time (ms)                                                            |    18,033 |     9,308 |    18,254
> response time std deviation (ms)                                                   |    11,611 |     4,856 |    11,647
> response time 50th percentile (ms)                                                 |    15,002 |     9,639 |    15,002
> response time 75th percentile (ms)                                                 |    15,003 |    13,275 |    15,003
> response time 95th percentile (ms)                                                 |    59,981 |    17,621 |    59,609
> response time 99th percentile (ms)                                                 |    60,001 |    20,090 |    60,001
> mean throughput (rps)                                                              |    150.61 |      3.73 |    146.88
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                             12  (0.03%)
> OK: 800 ms <= t < 1200 ms                                                                                   7  (0.02%)
> OK: t >= 1200 ms                                                                                          895  (2.43%)
> KO                                                                                                     35,986 (97.52%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     33,387 (92.78%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,599  (7.22%)
========================================================================================================================

Run #4
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     3,148 |    33,752
> min response time (ms)                                                             |         5 |         5 |    15,000
> max response time (ms)                                                             |    60,017 |    12,317 |    60,017
> mean response time (ms)                                                            |    16,620 |     1,750 |    18,006
> response time std deviation (ms)                                                   |    11,679 |     2,304 |    11,228
> response time 50th percentile (ms)                                                 |    15,002 |       569 |    15,002
> response time 75th percentile (ms)                                                 |    15,003 |     2,375 |    15,003
> response time 95th percentile (ms)                                                 |    55,774 |     6,660 |    59,259
> response time 99th percentile (ms)                                                 |    60,001 |     7,795 |    60,001
> mean throughput (rps)                                                              |    150.61 |     12.85 |    137.76
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          1,821  (4.93%)
> OK: 800 ms <= t < 1200 ms                                                                                 205  (0.56%)
> OK: t >= 1200 ms                                                                                        1,122  (3.04%)
> KO                                                                                                     33,752 (91.47%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     31,500 (93.33%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,252  (6.67%)
========================================================================================================================

Run #5
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     5,404 |    31,496
> min response time (ms)                                                             |         4 |         4 |    15,000
> max response time (ms)                                                             |    60,025 |    15,105 |    60,025
> mean response time (ms)                                                            |    15,942 |     2,886 |    18,182
> response time std deviation (ms)                                                   |    12,016 |     3,374 |    11,530
> response time 50th percentile (ms)                                                 |    15,001 |     1,144 |    15,002
> response time 75th percentile (ms)                                                 |    15,002 |     5,313 |    15,002
> response time 95th percentile (ms)                                                 |    53,436 |    10,037 |    58,919
> response time 99th percentile (ms)                                                 |    60,001 |    10,783 |    60,001
> mean throughput (rps)                                                              |    150.61 |     22.06 |    128.56
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          2,592  (7.02%)
> OK: 800 ms <= t < 1200 ms                                                                                 151  (0.41%)
> OK: t >= 1200 ms                                                                                        2,661  (7.21%)
> KO                                                                                                     31,496 (85.36%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     29,271 (92.94%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,225  (7.06%)
========================================================================================================================

Run #6
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     3,627 |    33,273
> min response time (ms)                                                             |         6 |         6 |    15,000
> max response time (ms)                                                             |    60,020 |    10,394 |    60,020
> mean response time (ms)                                                            |    16,342 |     1,826 |    17,924
> response time std deviation (ms)                                                   |    11,590 |     2,324 |    11,086
> response time 50th percentile (ms)                                                 |    15,002 |       854 |    15,002
> response time 75th percentile (ms)                                                 |    15,002 |     2,545 |    15,002
> response time 95th percentile (ms)                                                 |    51,553 |     8,087 |    56,861
> response time 99th percentile (ms)                                                 |    60,001 |     9,566 |    60,001
> mean throughput (rps)                                                              |    150.61 |      14.8 |    135.81
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          1,730  (4.69%)
> OK: 800 ms <= t < 1200 ms                                                                                 461  (1.25%)
> OK: t >= 1200 ms                                                                                        1,436  (3.89%)
> KO                                                                                                     33,273 (90.17%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     31,113 (93.51%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,160  (6.49%)
========================================================================================================================

Run #7
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     5,001 |    31,899
> min response time (ms)                                                             |         4 |         4 |    15,000
> max response time (ms)                                                             |    60,019 |    18,882 |    60,019
> mean response time (ms)                                                            |    15,910 |     2,097 |    18,076
> response time std deviation (ms)                                                   |    11,940 |     3,101 |    11,349
> response time 50th percentile (ms)                                                 |    15,002 |       487 |    15,002
> response time 75th percentile (ms)                                                 |    15,002 |     3,198 |    15,002
> response time 95th percentile (ms)                                                 |    52,104 |     8,566 |    57,676
> response time 99th percentile (ms)                                                 |    60,009 |    15,129 |    60,001
> mean throughput (rps)                                                              |    150.61 |     20.41 |     130.2
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          2,857  (7.74%)
> OK: 800 ms <= t < 1200 ms                                                                                 133  (0.36%)
> OK: t >= 1200 ms                                                                                        2,011  (5.45%)
> KO                                                                                                     31,899 (86.45%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     29,721 (93.17%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,178  (6.83%)
========================================================================================================================

Run #8
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     5,532 |    31,368
> min response time (ms)                                                             |         4 |         4 |    15,000
> max response time (ms)                                                             |    60,002 |    19,524 |    60,002
> mean response time (ms)                                                            |    15,759 |     2,409 |    18,113
> response time std deviation (ms)                                                   |    12,010 |     3,725 |    11,413
> response time 50th percentile (ms)                                                 |    15,002 |       467 |    15,002
> response time 75th percentile (ms)                                                 |    15,002 |     3,813 |    15,002
> response time 95th percentile (ms)                                                 |    49,589 |    12,055 |    57,740
> response time 99th percentile (ms)                                                 |    60,001 |    15,619 |    60,001
> mean throughput (rps)                                                              |    150.61 |     22.58 |    128.03
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          3,079  (8.34%)
> OK: 800 ms <= t < 1200 ms                                                                                 120  (0.33%)
> OK: t >= 1200 ms                                                                                        2,333  (6.32%)
> KO                                                                                                     31,368 (85.01%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     29,200 (93.09%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,168  (6.91%)
========================================================================================================================

Run #9
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     5,237 |    31,663
> min response time (ms)                                                             |         4 |         4 |    15,000
> max response time (ms)                                                             |    60,006 |    13,909 |    60,006
> mean response time (ms)                                                            |    15,910 |     2,161 |    18,184
> response time std deviation (ms)                                                   |    12,112 |     3,052 |    11,532
> response time 50th percentile (ms)                                                 |    15,002 |       528 |    15,002
> response time 75th percentile (ms)                                                 |    15,002 |     3,376 |    15,002
> response time 95th percentile (ms)                                                 |    50,211 |     8,356 |    58,190
> response time 99th percentile (ms)                                                 |    60,002 |    13,045 |    60,001
> mean throughput (rps)                                                              |    150.61 |     21.38 |    129.24
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          2,898  (7.85%)
> OK: 800 ms <= t < 1200 ms                                                                                 195  (0.53%)
> OK: t >= 1200 ms                                                                                        2,144  (5.81%)
> KO                                                                                                     31,663 (85.81%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     29,425 (92.93%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,238  (7.07%)
========================================================================================================================

Run #10
========================================================================================================================
---- Global Information -------------------------------------------------------------|---Total---|-----OK----|----KO----
> request count                                                                      |    36,900 |     4,535 |    32,365
> min response time (ms)                                                             |         4 |         4 |    15,000
> max response time (ms)                                                             |    60,002 |    32,100 |    60,002
> mean response time (ms)                                                            |    16,028 |     1,661 |    18,041
> response time std deviation (ms)                                                   |    11,897 |     2,569 |    11,290
> response time 50th percentile (ms)                                                 |    15,002 |       329 |    15,002
> response time 75th percentile (ms)                                                 |    15,002 |     2,377 |    15,002
> response time 95th percentile (ms)                                                 |    45,150 |     7,581 |    56,680
> response time 99th percentile (ms)                                                 |    60,001 |     9,456 |    60,001
> mean throughput (rps)                                                              |    150.61 |     18.51 |     132.1
---- Response Time Distribution ----------------------------------------------------------------------------------------
> OK: t < 800 ms                                                                                          2,841   (7.7%)
> OK: 800 ms <= t < 1200 ms                                                                                 186   (0.5%)
> OK: t >= 1200 ms                                                                                        1,508  (4.09%)
> KO                                                                                                     32,365 (87.71%)
---- Errors ------------------------------------------------------------------------------------------------------------
> i.g.h.c.i.PrematureCloseException: Premature close                                                     30,180 (93.25%)
> Request timeout to localhost/127.0.0.1:8080 after 60000 ms                                              2,185  (6.75%)
========================================================================================================================